{"out.token_id": 0, "input_quant_fp8.pi": 1, "packedloralayerweight": 2, "app.state.engin": 3, "primary_weight": 4, "glm4vprocessinginfo": 5, "embeds.split": 6, "engineargs.logits_processor_pattern": 7, "ys.append": 8, "zsock": 9, "cosin": 10, "outputprocessor.": 11, "non-uuid": 12, "mup": 13, "e5-smal": 14, "relev": 15, "slot-": 16, "mergedcolumnparallellinearwithshardedlora": 17, "nonnvmlcudaplatform": 18, "responsesrequest": 19, "uc": 20, "oraclecloud": 21, "tp_str": 22, "tpumodelload": 23, "layer.g1_scale_c": 24, "runai_streamer_shard": 25, "item.end_idx": 26, "nowait": 27, "self.engine.check_health_async": 28, "use_int8_w8a8": 29, "demotoolserv": 30, "reduced-lay": 31, "get_token_per_chunk_from_config": 32, "--text-lay": 33, "src_kv_caches.valu": 34, "vllm.v1.worker.tpu_model_runn": 35, "reasons.append": 36, "report_device_id": 37, "has_context": 38, "newnam": 39, "--distributed-executor-backend": 40, "w.is": 41, "self.info.get_num_image_token": 42, "phi-3.5-vision-instruct": 43, "death_pipe.recv": 44, "out_uq": 45, "self.client_index": 46, "m-base": 47, "method.block_128x128.valu": 48, "self.intermedi": 49, "vllm_config.compilation_config.disabled_custom_op": 50, "mbda": 51, "eos-lik": 52, "self.__dict__.item": 53, "gfp-wisconsin-madison-the-nature-boardwalk.jpg": 54, "enable_python_dispatch": 55, "self.maybe_wait_for_kv_sav": 56, "default_max_len": 57, "self.nixl_wrapper.prep_xfer_dlist": 58, "torch.ops._c.dynamic_per_token_scaled_fp8_qu": 59, "elt": 60, "new-impl": 61, "num_computed_tokens.": 62, "shared_memori": 63, "resolve_mistral_chat_template.": 64, "on_page_markdown": 65, "target_seq_len": 66, ".self": 67, "a_typ": 68, "--verbos": 69, "compare_fram": 70, "ssm_prefix": 71, "structured-output": 72, "table.numel": 73, "nvml_temperature_threshold_mem_max": 74, "readthedocs_version_typ": 75, "messag": 76, "corrected_predict": 77, "70b": 78, "tilesize128x128x64": 79, "bitblas.": 80, "pe.clon": 81, "shmringbuff": 82, "frames.shap": 83, "c_cap_result": 84, "llama3": 85, "engine_core_proc": 86, "group.world": 87, "bound_args.apply_default": 88, "current": 89, "setuptool": 90, "preempted_request": 91, "aitermlabackend": 92, "explicit_output": 93, "self.sliding_window-1": 94, "data-s": 95, "quant.num": 96, "completion_poolings.model_dump": 97, "gemmamlp": 98, "8.39": 99, "terminology.": 100, "vllm.compilation.fx": 101, "speculative_config.use_eagl": 102, "x_scaled.view_a": 103, "outputs.i": 104, "2_core": 105, "64.": 106, "self.coordinator.cach": 107, "dgi": 108, ".mteb": 109, "decode.metadata": 110, "vllm.model_executor.layers.fused_moe.cutlass_mo": 111, "activity.cpu": 112, "attn.attn.lay": 113, "old_g": 114, "model_runner.num_reqs_max_model_len": 115, "lora_config_path": 116, "self.get_max_item": 117, "self.metrics.gaug": 118, "a.reshap": 119, "temp_config.kv_transfer_config": 120, "w2_shape": 121, "llm_gener": 122, "write_bytes_to_buff": 123, "dummy_test_vectors.generation_token": 124, "--generation-config": 125, "types.output": 126, "tokens_per_expert.to": 127, "module_as_written": 128, "y_q_ptr": 129, "inner_cross_attn.": 130, "nx2_w1": 131, ".device_communicator.qr_comm": 132, "masks.": 133, "image_input.shap": 134, "opt_flag": 135, "file.jsonl": 136, "dcmp.right_on": 137, "logits.sid": 138, "test_lora_adapters.pi": 139, "test_cascade_attent": 140, "vllm.utils._placehold": 141, "pynccl_comm.rank": 142, "platform.get_device_communicator_cl": 143, "self.has_shared_expert": 144, "vicuna-7b-v1.3": 145, "_gemm": 146, "metric.label": 147, "unquant": 148, "decode_metadata.block_tables_succ": 149, "c_vgpuutilinfo.vgpuinstancecount": 150, "gnvz6p3fd23hh": 151, "torch.mm": 152, "librocm_cor": 153, "neox.get": 154, "preprocess": 155, ".cpu_group": 156, "self.create_encoder_prompt": 157, "_init_model": 158, "block_pool": 159, "mq_llm_engin": 160, "terminated.": 161, "rocess": 162, "llguidance.llmatcher.grammar": 163, "ntile": 164, "disallow": 165, "req0.block": 166, "float16_mantissa_bit": 167, "final_states_ref": 168, "image_inputs.imag": 169, "moe_layer_start_index": 170, "type.u16": 171, "seq_group_metadata.token_type_id": 172, "output.model_validate_json": 173, "workspace1": 174, "llm_int8_threshold": 175, "train_model": 176, "._parse_video_data": 177, "get_mamba_chunk_s": 178, "self._to_mm_item": 179, "scale.data": 180, "decoder_tokens_prompt": 181, "0.0": 182, "processor.pad_dummy_encoder_prompt": 183, "autoloaded_weight": 184, "nn.glu": 185, "ratio_height": 186, "0x11": 187, "self.code_revis": 188, "expected_chat_logprob": 189, "layer.w2_weight.s": 190, "self.quant_fp8": 191, "vgputypebar1info": 192, "test_prompts.pop": 193, "layer_utils.pi": 194, "process_runner_output": 195, "envs.vllm_max_tokens_per_expert_fp4_mo": 196, "self.get_image_size_for_crop": 197, "padding_gap": 198, "lowercas": 199, "topk_chunk": 200, "parser.__init__": 201, "self.parser.process": 202, "reponam": 203, "packed.data": 204, "model.pi": 205, "enc_hook": 206, "subcommand_nam": 207, "params.extra_kwarg": 208, "og_dtyp": 209, "ref_block_tables_transform": 210, "backend.append": 211, "extend.imag": 212, "recv_metadata_list": 213, "remove_oldest_adapt": 214, "dq_weight": 215, "self.path.is_fil": 216, "wo_activation_out": 217, "self.triton": 218, "test_classify_models_using_activ": 219, "abort_requests_async": 220, "replay_payload": 221, "self.worker.list": 222, "batteri": 223, "platform": 224, "auto-detect": 225, "loc.dim": 226, "self.vision_model.post_layernorm": 227, "self.audio_projection_for_vis": 228, "add_mock_model_method": 229, "save_to_fil": 230, "_convert_to_tensor": 231, "tool_start": 232, "mask_dv": 233, "machdep.cpu.brand_str": 234, "output_conv": 235, "jsontree.pi": 236, "new_src_item": 237, "stride_bm": 238, "wrapper.util": 239, "logprob.": 240, "prompt_t.to": 241, "feature_sample_lay": 242, "nvml_fi_dev_nvlink_speed_mbps_common": 243, "classificationrequest": 244, "get_encod": 245, "mm_placeholder_storage.valu": 246, "t.accumul": 247, "unintend": 248, "hf_log": 249, "batch_fram": 250, "moonvitpretrainedmodel": 251, "scheduled_priorities.append": 252, "nki_out.shap": 253, "load_adapter_func": 254, "socket.send": 255, "cat.": 256, "thread_num": 257, "res.num_cached_token": 258, "request.rec": 259, "self.output_queues.pop": 260, "model_runner.initialize_kv_cach": 261, "non-symmetr": 262, ".pre_mixer_norm": 263, "api.get": 264, "ache_group_id": 265, "worker.rpc_broadcast_mq.wait_until_readi": 266, "build_summary_stats_tree_df": 267, "nvml_fi_dev_nvlink_get_power_st": 268, "ry_start_loc": 269, "sample_logprob.decoded_token": 270, "weight_gener": 271, "kv_cache_spec.num_kv_head": 272, "self.metric_data.queri": 273, "tui": 274, "client.responses.cancel": 275, "rayprometheusmetr": 276, "client.check": 277, "maximum": 278, "config.device_config": 279, "allocator._block_tracker.key": 280, "scheduler_config.max_num_batched_token": 281, "issue-1296092364": 282, "extract_st": 283, "leaf.siz": 284, "test_grayscale_image.png": 285, "inf2": 286, "tokens_per_expert.max": 287, "arg.value.id": 288, "self.config.mast": 289, "args.max_lora": 290, "fnn": 291, "completion_stream_gener": 292, "tmami": 293, "hashes2": 294, "result_1": 295, "supported.maxvers": 296, "mlp1_weight": 297, "qwenimageinput": 298, "6.2": 299, "kv_cache_start": 300, "act_fn": 301, "meta_reordered.devic": 302, "self.models.key": 303, "mambacachemanag": 304, "logits_returns.append": 305, "ops.gptq_marlin_gemm": 306, "sparingly.": 307, "max_tokens_across_dp_cpu": 308, "nvmldevicecap": 309, "llm.score": 310, "testtensors.mak": 311, "serving_transcription.pi": 312, "self.load_in_8bit": 313, "tensors8bit.make_moe_tensors_8bit": 314, "noazp": 315, "req_to_tokens.strid": 316, "packed_": 317, "self.structured_output_manager.should_adv": 318, "shard_indices.added_vocab_start_index": 319, "marlin_make_empty_g_idx": 320, "hunyuana13breasoningpars": 321, "torch.nn": 322, "user_turn": 323, "task_start_stop_tim": 324, ".q_proj.output_scal": 325, "sake": 326, "self._previous_batch_request_id": 327, "self.backbone.mak": 328, "square.": 329, "robertaembeddingmodel": 330, "llamaforcausallm.embedding_padding_modul": 331, "_argument": 332, "baichuan7b-zero-regex": 333, "nccl.": 334, ".appli": 335, "loader_tc.to_serializ": 336, "embedding.dtyp": 337, "nvml_pcie_atomics_ops_max": 338, "map.index": 339, "tat": 340, "processing.md": 341, "url": 342, ".max_chunk_byt": 343, "nvmldevicesetmigmod": 344, "logitsprocessorwithlora.": 345, "expected_api_key": 346, "len_num": 347, "act_num_seg": 348, "test_fail_upon_inc_requests_and_finished_requests_lt_available_block": 349, "quark-quant": 350, "self.runner.cross": 351, "self._normalize_sampl": 352, "òkìɽɯ": 353, "devicecapability.to_int": 354, "nvmlclocksthrottlereasonswpowercap": 355, "learnabl": 356, "w2_w": 357, "self.spec_decode_unsupported_reqs.discard": 358, "pqdm.thread": 359, "layer.w2_weight_scale.dim": 360, "test_model_specif": 361, ".interfac": 362, "stride_od": 363, "test.id": 364, "guestdriververs": 365, "rt-base": 366, "port_offset": 367, "model_runner_output0": 368, "self.__dict__": 369, "processing.": 370, "rix_a": 371, "mla_decode_fwd": 372, "vg": 373, "request_ids_to_abort": 374, ".start": 375, "_data.shap": 376, "test_extract_tool_calls_with_argu": 377, "get_slopes_power_of_2": 378, "mxfp4": 379, "get_node_and_gpu_id": 380, "nvml_fi_dev_nvlink_ecc_data_error_count_l8": 381, "tool_nam": 382, "self.storage_torch_dtyp": 383, "bhd": 384, "causal_conv1d_ref": 385, "reconfigureranktype.shutdown": 386, "resolved_requirements.append": 387, "t_slice": 388, "pm.fwd": 389, "burstiness.": 390, "to_pf_class_typ": 391, "torch.xpu.mem_get_info": 392, "front": 393, "long_text_2500_words.split": 394, "decode_q_seqlens.tolist": 395, "ptr.to": 396, "sampled_id": 397, "non_skip_special_token": 398, "nvmldevicesetpersistencemod": 399, "pytest.approx": 400, "worker.work": 401, "args.num_cli": 402, "tokenizer.bos_token_id": 403, "why-do-some-models-have-multiple-templ": 404, "pool._maybe_evict_cached_block": 405, "tate": 406, "placeholders.get": 407, "kv_shape": 408, "lora_repo": 409, "0.8.99": 410, "load_weights_using_from_2_way_softmax": 411, "object_tensor": 412, "self.model.decoder_attention_typ": 413, "qwen2moesparsemoeblock": 414, "dong": 415, ".builder": 416, "1920px-orang": 417, "np.concaten": 418, "vllm.attention.backends.rocm_aiter_mla.aitermlabackend": 419, "_split_list_into_rang": 420, "delta_text.index": 421, "envs.vllm_torch_profiler_with_stack": 422, "tt.with": 423, "mllamaconfig": 424, "im_assist": 425, "num_decode_query_token": 426, "allo": 427, "_d": 428, "_nvmlgetfunctionpointer_cach": 429, "_customized_method_to_quant_config": 430, "torch.fx.interpret": 431, "int8_info.max": 432, "oj.png": 433, "device_mla_backend": 434, "pooling_output.data": 435, "test_scheduler_encoder_decoder.pi": 436, "test_sampling_param": 437, "self._pin_lora_in_gpu_cach": 438, "un-tensor": 439, "key_cache.shap": 440, "uuid.uuid1": 441, "process_args.append": 442, "text_config.attention_head_dim": 443, "nvml_fi_dev_nvlink_throughput_data_tx": 444, "in_qqq_gemm": 445, "optre": 446, "weight_scale_swizzled.data": 447, "init_worker_distributed_environ": 448, "self.origin": 449, ".__init__": 450, "self.head.paramet": 451, "assertion": 452, "healthcheck": 453, "k.unflatten": 454, "ax_num_seq": 455, "self.hard_embedding_norm": 456, "test_handshake_fails_on_kv_cache_layout_mismatch": 457, "server.should": 458, "fini": 459, "datetime.datetime.now": 460, "accented_m": 461, "test_rocm_compressed_tensors_w8a8": 462, "nvml_fi_dev_nvlink_replay_error_count_l6": 463, "last_block.next_free_block": 464, "minimaxtext01linearkernel.jit_linear_forward_prefix": 465, "nvml_gpu_fabric_health_mask_degraded_bw_not_support": 466, "test_basic_funct": 467, "compiled_fx_graph_hash": 468, "ctx.save": 469, "_rank": 470, "attn_bias": 471, "get_mixed_modalities_queri": 472, "no-flag": 473, "nonsens": 474, "bitblas_matmul.config.with_zero": 475, "self.punica_wrapper._embeddings_indic": 476, "self.compiler.initialize_cach": 477, "interconnect": 478, "url_2": 479, "whitelist.": 480, "tool_from_mcp.nam": 481, "ecosystem": 482, "sliding_window_contiguous_block": 483, "self.speculative_config.method": 484, "cfg.downsampl": 485, "eav": 486, "_encode_mm_field": 487, "offsets_a": 488, "opentelemetry.exporter.otlp.proto.grpc.trac": 489, "pagedattention.writ": 490, "fp8e4m3pertensorspec": 491, "args.chunk": 492, "token_logprob_list": 493, "deferred_sample_results_arg": 494, "connections.": 495, "a1_m": 496, "self.map": 497, "weight_bia": 498, "bias_ref": 499, "voxtraldummyinputsbuild": 500, "test_permute_col": 501, "19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo": 502, "self._refcount": 503, "autogen_ext.models.openai.openaichatcompletioncli": 504, "kv_new": 505, "benchmark_rmsnorm.pi": 506, ".load_merged_column_weight": 507, "pad.permut": 508, ".current_actor": 509, "added_tokens.item": 510, "gemmarmsnorm": 511, "vl01imag": 512, "sched_meta": 513, "strategy.rout": 514, "ops.mla_decode_kvcache_cpu": 515, "f.default_factori": 516, "kv_connector_metadata.": 517, "maxpo": 518, "completion.model": 519, "active_block_table.to": 520, "image_input_per_rank": 521, "default_sort_by_lora_id": 522, "swin": 523, "self.model_executor": 524, "group.cpu": 525, "self._action_groups.append": 526, "quant_config.torch_storage_dtyp": 527, "dt2": 528, "neuronx.const": 529, ".ca": 530, "guide.ipynb.": 531, "test_multinode_dp_complet": 532, "resolved_config": 533, "setuptools.command.build_ext": 534, "requestgpu": 535, "parse.add_argu": 536, "hidden_states.shap": 537, "self.shutdown_event.set": 538, "feedback.": 539, "num_m_block": 540, "self.column_sharded_weights_modules.append": 541, "args.limit_min_token": 542, "vllm.entrypoints.openai.serving_chat": 543, "llguidance.lltoken": 544, "scheduler_delay_factor": 545, "test_extract_tool_calls_no_tool": 546, "self.kv_cache_config": 547, "logprobs.extend": 548, "inspect.signatur": 549, "get_vllm_mllama_model_input": 550, "-self.attn": 551, "autoscaling_config": 552, "to_drop": 553, "openai_pooling_client.pi": 554, "inference_engines.append": 555, "self.extra_kwarg": 556, "back_publish_address": 557, "set_multiprocessing_worker_env": 558, "flashinfer_comm.fp4quantizationsflayout.swizzl": 559, "tmp_max_len": 560, ".post_mixer_norm": 561, "prompt_embeds_list": 562, "violations.extend": 563, "greater_than_equ": 564, "compilationlevel.no": 565, "hf_config.ssm_state_s": 566, "self._req_id": 567, "engine_args.enable_lora": 568, "embedding.get_next_input_positions_tensor": 569, "bambaforcausallm": 570, "wil": 571, "x_scale.numel": 572, "17-150x600.jpg": 573, "mhz.": 574, "inner_text_config.vocab_s": 575, "nvmldevicegetpciinfoext": 576, "cmdclass": 577, "sys.exc": 578, "single-scal": 579, ".last_output": 580, "config.rotary_kwarg": 581, "0.publish": 582, "name.replac": 583, "nvml_cc_system_multigpu_non": 584, "appreci": 585, "speculative_draft_tensor_parallel_s": 586, "run-nightly-benchmarks.sh": 587, "is_fp8_w8a8_support": 588, "self.language_model.compute_logit": 589, "stride_dt_cs": 590, "markdownlint-dis": 591, "test_ssl_cert_refresher.pi": 592, "attention_probs_drop": 593, "w8a4": 594, "self.layernorm_embed": 595, "state.current_step": 596, "schedule_m": 597, "results_df.to_csv": 598, "redirect_nam": 599, "hub_repo": 600, "handle_chat_complet": 601, "_remove_request": 602, "vllm.model_executor.layers.quantization.kernels.mixed_precision.conch": 603, "gpu_kineto_event.nam": 604, "byteord": 605, "moe.modular": 606, "batched_rope.forward": 607, "qkv_proj.scheme.input_quant.strategi": 608, "ubatchslic": 609, "torchcompilewrapperwithcustomdispatch": 610, "availability_": 611, "testcas": 612, "parenthes": 613, "crucial": 614, "0.kv": 615, "nvmleventtypesinglebiteccerror": 616, "_add_ext_pw_lay": 617, "vgpuutilinfo": 618, "all_env": 619, "xla_lib.defin": 620, "noinitortensorimpl": 621, "tree_len": 622, "token_pool": 623, "args.use_different_prompt_per_request": 624, "platform.can": 625, "unlimited.": 626, "init_audio_modul": 627, "roofline.": 628, "file.trunc": 629, "handler.level": 630, "self.failure_callback": 631, "val.elt": 632, "mockexternalprocess": 633, "huggingfac": 634, "test_bitblas.pi": 635, "_preempt": 636, "maori": 637, "_load_fused_module_from_checkpoint": 638, "pass_manager2": 639, "large-scal": 640, "chatcommand.add": 641, "processor-rel": 642, "feed_forward": 643, "riabl": 644, "pub_0": 645, "get_config_quant_dtyp": 646, "set_weight_at": 647, "throughput.to_dict": 648, "action.help": 649, "mask.bitwis": 650, "repeat_and_sort_request": 651, "noqa": 652, "hd_feature_transform": 653, "fake": 654, "self.pass_config.enable_sequence_parallel": 655, "self.tokenizer.decod": 656, "figcapt": 657, "self.conv_st": 658, "-curr": 659, "tl.clamp": 660, "beam_search-": 661, "compiled_graph_wrapp": 662, "pltpu.semaphoretype.dma": 663, "x_b": 664, "unique_dp": 665, "saw_": 666, "version.md": 667, "layer.q": 668, "v1.0.0.": 669, "request.sampling_param": 670, "base_yq_offset": 671, "v.dtype": 672, "self.sender_socket": 673, "--hf-overrides.key5": 674, "1hr.": 675, "tokens_roi_recv": 676, "vllm.general_plugin": 677, "d.world": 678, "cache3": 679, "key.reshap": 680, "vllm.lora.peft_help": 681, "config.imag": 682, "vllmconfig.__post_init__": 683, "ggufread": 684, "vllm_model.classifi": 685, "qwen1.5-1.8b-chat-gptq-4bits-dynamic-cfg-with-lm_head-sym": 686, "lq": 687, "nvmlvgpupgpucompat": 688, "re_llama_byte_token.match": 689, "inputs.": 690, "ou": 691, "tempfile.namedtemporaryfil": 692, "testonetokenbadword": 693, "subparsers.": 694, "vllm_allow_chunked_local_attn_with_hybrid_kv_cach": 695, "commons.lay": 696, "state_dict": 697, "pd.set": 698, "self.expert_params_map": 699, "tool_call_nam": 700, "xformers.attent": 701, "nvmlvgputypebar1info": 702, "pooling.": 703, "config.tensor_parallel_s": 704, "app.root_path": 705, "self.encoder_cache_manager.get_cached_input_id": 706, "logitproc": 707, "seq_cls_model.save_pretrain": 708, "llm.llm_engine.schedul": 709, "zamba2.pi": 710, "mistral_tokenizer.instruct.end_think": 711, "pytest.fixturerequest": 712, "self.input_size_per_partit": 713, "_backend.xformers_vllm_v1": 714, "commid": 715, "config.stack": 716, "self.logprobs_processor": 717, "finished_request.max_tokens_param": 718, "c.reshap": 719, "get_stat": 720, "rms_norm_weight": 721, "conv_": 722, "_parse_and_validate_multimodal_input": 723, "__call__.": 724, "enum.cpu": 725, "exaon": 726, "test_prefill_schedule_max_lora": 727, "is_ieee_754": 728, "self.match_idx": 729, "merges_fil": 730, "case.tp": 731, "self.n_head_kv": 732, "default_output_multiplier_scal": 733, "input_list": 734, "a1.mul": 735, "os.chdir": 736, "reshaped_x": 737, "chameleonlayernorm": 738, "_arr": 739, "text_llm.get_token": 740, "self.polici": 741, "automodel.from_pretrain": 742, "url.detail": 743, ".prev_free_block": 744, "copy.clear": 745, "engine_args.kv_events_config": 746, "assign_ast.target": 747, "_add_attn_metadata_broadcastable_dict": 748, "executor.i": 749, "self._output_token_ids.extend": 750, "ctx.destroy": 751, "logpro": 752, "logprobs.top": 753, "out_mm": 754, "self.populate_kv_cach": 755, "in.shap": 756, "gpt-oss-120b": 757, "t.b_num_bit": 758, "view.": 759, "use_connector": 760, "self.engine.reset": 761, "self.cudagraph_key": 762, "window": 763, "ref_multi_query_kv_attent": 764, "abi": 765, "out_quant.to": 766, "cfg_desc": 767, "all_violations.extend": 768, "enum.unknown": 769, "task.item": 770, "quant_config.apply_vllm_mapp": 771, "nongpu": 772, "2-gram": 773, "test_filesystem_resolv": 774, "cpugpublockalloc": 775, "inputs_v": 776, "gguf_weights_map": 777, "call.interpret": 778, "testagcutlassscaledmmmodel": 779, "compressed_tensors.pi": 780, "engine.wak": 781, "0-9a-f": 782, ".data.get": 783, "a1q.numel": 784, "returned_outputs.append": 785, "self._x.index": 786, "apply_weight": 787, "test_compressed_tensors_nvfp4": 788, "self._run_scor": 789, "up_siz": 790, "reorder_w1w3_to_w3w1": 791, ".c_norm.weight": 792, "debug_stat": 793, "diff_profile.timestamp": 794, "fp8_dynam": 795, "silu_and_mul.": 796, "get_dummy_text": 797, "video_loader_registry.regist": 798, "et_forward_context": 799, "self.current_wav": 800, "555-5657": 801, "abcdefghijklmnopqrst": 802, "engine_alive.valu": 803, "stopped_running_req": 804, "queue.fake_free_list_head.next_free_block": 805, "args.channel": 806, "test_case.get": 807, "mllavaprocessor.from_pretrain": 808, "marlin_utils_fp8.pi": 809, "inputs_kv": 810, "scalar_t": 811, "metric_with_labels.match": 812, "block.attention.no_op": 813, "author.": 814, "multi_modal_placeholder_index_map": 815, "decode_meta.max_seq_len": 816, "_transformers_supported_model": 817, "test_model_loader_download_fil": 818, "ordering.": 819, "test_transcription_validation.pi": 820, "self.azp": 821, "importerror": 822, "sys.stderr": 823, "persimmon.pi": 824, "tl.sqrt": 825, "model_input.request_ids_to_seq_id": 826, "_compare_sp": 827, "state_v1_t": 828, "...core.block.e2e.test": 829, "quant.quantizationmethod": 830, "block.pool_id": 831, "full_hash": 832, "response.model_dump": 833, "ab_strides1": 834, "inter-data": 835, "torchao": 836, "xgrammar.pi": 837, "inplace_fused_expert": 838, "per_token_scale_a": 839, "base_v1": 840, "vllm.vllm_flash_attn._vllm_fa3_c": 841, "standalone_test": 842, "mead10": 843, "vllmdatatype.u8b128": 844, "test_customize_logg": 845, "school": 846, "vllm.lora.peft": 847, "self._convert_result": 848, "self.post_attn_norm": 849, "self.non_kv_cache_memori": 850, "params.pi": 851, "vllm.v1.core.sched.async_scheduler.asyncschedul": 852, "deepseek-coder-v2-lite-instruct": 853, "prompt_logprobs_1": 854, "16x64": 855, "get_num_free_cpu_block": 856, "0b11110000": 857, "set_current_vllm_config": 858, "first_trace_differ": 859, "prefil": 860, "52b-instruct-2407": 861, "self.prefix_cac": 862, "aramet": 863, "max_source_posit": 864, "is_available_onlin": 865, "indices.ad": 866, "cpu_fused_moe.ipex": 867, "make_causal_mask": 868, "responseusag": 869, "nl.zero": 870, "flash": 871, "lora_kwarg": 872, "mamba_page_size_pad": 873, "batch_next_token_id": 874, "batch.unfold": 875, "lm_head": 876, "value_cache.squeez": 877, "self.eplb_st": 878, "len.extend": 879, "throttling.": 880, "tileschedul": 881, "proc.stdout.readuntil": 882, "base_prompt_token_count": 883, "handler.show": 884, "self.kv_proj_shard_s": 885, "args.with": 886, "_vllm": 887, "community.llm": 888, "simplecontext": 889, "replay_socket.pol": 890, "attn_nodes_post": 891, "state.view": 892, "python_free_callback": 893, "self.lora_nam": 894, "self.cross_attn_attn_g": 895, "25-th": 896, "start_dat": 897, "vllm.engine.output_processor.interfac": 898, "self.post_layer_norm": 899, "10mb.": 900, "test_reset_prefix_cach": 901, "h-groups.": 902, "1.jpg": 903, "self.norm._forward": 904, "step3-fp8": 905, "captur": 906, "send_messag": 907, "process_output_socket": 908, "tool_typ": 909, "nvmldevicegetgpuinstancebyid": 910, "num_embed": 911, "view.shap": 912, "offs_out_m": 913, "processor_inputs.mm_data": 914, "batch_update_builder.moved.append": 915, "eventbatch": 916, "openai_r": 917, "test_tokenize_complet": 918, "internal_analysi": 919, "ai.latency.e2": 920, "mock_resolver_nam": 921, "obj.dtyp": 922, "common_attn_metadata.slot_mapping.long": 923, "0_5-llama-3_2-1b": 924, "convert_dense_cross_attention_mask_to_tensor": 925, "_get_cuda_graph_pad_s": 926, "currentclockspe": 927, "multiply.": 928, "self.signal_pipe.send_tensor": 929, "scientif": 930, "runnablepassthrough": 931, "0x0000000000000002": 932, "stmt.target.id": 933, "evil": 934, "modeling_llava.pi": 935, "types.int8": 936, "adjust_shard_indexes_for_pack": 937, "eg2mk": 938, "kv_connector": 939, "feb": 940, "financi": 941, "n_blocks_per_seq": 942, "nvmldevicegethostvgpumod": 943, "self.base_layer.total_num_kv_head": 944, "rmsnormandquantophelp": 945, "nonstream": 946, "llm.get_default_sampling_param": 947, "jn": 948, "realloc": 949, "singer_id": 950, "torch.cuda.mem_get_info": 951, "upload-wheels.sh": 952, "torch_trace_dir_path": 953, "psutil.no": 954, "model_info.v0_on": 955, "config.env": 956, "each.worker.get": 957, "info.activation_format": 958, "dequant_weight": 959, "torch.bfloat16.": 960, "other.fre": 961, "mbed": 962, "vllm.engine.protocol": 963, "nvml_gpm_metric_nvlink_l2_tx_per_sec": 964, "args.eagle_dir": 965, ".linear_2": 966, "self.parameter_prefix": 967, "handshake.": 968, "grok1-specif": 969, "mock_isab": 970, "scatter_idx": 971, "metricsmiddlewar": 972, "self._initialize_free_list": 973, "faketensor": 974, "request.module.": 975, "layer.q_scal": 976, "use_tool": 977, "f.interpol": 978, "file.start_new_lin": 979, "l552-l562": 980, "all-gather.": 981, "layer.transpos": 982, "fallback_regex": 983, "wait_for_completion_or_failur": 984, "._parse_audio_data": 985, "layer.weight_scale.to": 986, "w3_name": 987, "bskcn": 988, "blocks.upd": 989, "a-z0-9_": 990, "-3": 991, "test_update_states_request_unschedul": 992, "strategy.route_token": 993, "127.0.0.1": 994, "thinker_config.text_config": 995, "morph": 996, "non-transpos": 997, "kv_c_cach": 998, "input_3": 999, "opentelemetry.proto.common.v1.common": 1000, "self._get_function_cal": 1001, "self._get_token_lora_indic": 1002, "self._pub.bind": 1003, "bq_i32": 1004, "gen-ai.md": 1005, "self.pt_load_map_loc": 1006, "felis_catus-cat_on_snow.jpg": 1007, "model_input.attn_metadata": 1008, "test_reject_bad_config": 1009, "self.kv_event_publisher.shutdown": 1010, "request_generation_token": 1011, "prompt_token_ids_arr": 1012, "base.__subclasses__": 1013, "w1.is_contigu": 1014, "mark.parametr": 1015, "mean_e2el_m": 1016, "self.norm2": 1017, "nisa.dma": 1018, "hf_safetensors_tensor": 1019, "squenc": 1020, "single_image_base_prompt": 1021, "mistral.pi": 1022, "mi300x-triton-kernel-performance-optim": 1023, "ken_lora_indic": 1024, "self.config.use_thumbnail": 1025, "has_weight": 1026, "openaiservingchat.extract": 1027, "--model-nam": 1028, "shape-constraint": 1029, "num_evicted_block": 1030, "ref1": 1031, "nvmlvgpuinstancegetlicenseinfo_v2": 1032, "seq_start_loc": 1033, "self.full_attn_first": 1034, "selector.pi": 1035, "programfil": 1036, "replicatedlinear": 1037, "head_server.get_async_cli": 1038, "marlin_qqq_gemm": 1039, "server_idx": 1040, "multiple_newlin": 1041, "hash3": 1042, "neuron.": 1043, "vl-rerank": 1044, "vllm.v1.engine.mm_input_cach": 1045, "self.structured_decod": 1046, "mooncak": 1047, "vllm.lora.": 1048, "src_param": 1049, "dista": 1050, "test_supports_multimodal_input": 1051, "csv_filenam": 1052, "patch_pixel_valu": 1053, "inputs_vision_speech": 1054, "perm.siz": 1055, "c.label": 1056, "ignored_metr": 1057, "current_hard": 1058, "gritlmmeanpool": 1059, "self.random_reqs.discard": 1060, "hf_config.vision_config.pixel_shuffle_ratio": 1061, "token_position_in_logprob": 1062, "bt.bench_fn_kwarg": 1063, "torchsdpametadata": 1064, "test_partial_request_hit": 1065, "keep_current_rank": 1066, "argsort": 1067, "de-quantis": 1068, "sequencegrouptosample.sampling_params.top_p": 1069, "lora_meta": 1070, "broadcast_tensor_dict_test_work": 1071, "self._apply_prompt_upd": 1072, "tandem": 1073, "ached.": 1074, "smuggl": 1075, "tool_name_s": 1076, "self.calculate_hs_mask": 1077, "starcoder2-3b.q6_k.gguf": 1078, "stats.observ": 1079, "ops.copy_block": 1080, "mode.non": 1081, "gpu_block": 1082, "self.browser_tool.tool_config": 1083, "nvfp4_block_scale_interleav": 1084, "self.generation_config_field": 1085, "logger.level": 1086, "tl.__class__.__name__": 1087, "prefill_port": 1088, "cross_encod": 1089, "_lst": 1090, "output2_scales_scalar": 1091, "run_nemotron_vl": 1092, "effective_max_seq_len": 1093, "forconditionalgener": 1094, "max_blocks_per_batch": 1095, "args.backend": 1096, "_modelinfo": 1097, "prenotifi": 1098, "e.stdout": 1099, "preemptionmod": 1100, "req_data.prompt": 1101, "prefix_cached_llm": 1102, "self._run_work": 1103, "_get_encoder_config": 1104, "self.encoding.stop": 1105, "common_prefix_token": 1106, "self._patch_tensorizer_config": 1107, "file_list": 1108, "actual_tool_call.typ": 1109, "timm.models.visiontransform": 1110, "prefill.prefill_chunk": 1111, "vllm.attention.ops.flashmla": 1112, "gps": 1113, "request.max_completion_token": 1114, "juli": 1115, "----------------------": 1116, "weight_scale_channel": 1117, "w1_chunk": 1118, "self._text": 1119, "test_ckpt": 1120, "te_model_req.seq_group_metadata_list": 1121, "prefill_valu": 1122, "_norm": 1123, "config.in_dtyp": 1124, "compilationlevel.piecewis": 1125, "embedding_dim": 1126, "weight_typ": 1127, "new_hidden_s": 1128, "completion_respons": 1129, "engine_core.scheduler.request": 1130, "minimax_tool_parser.pending_buff": 1131, "test_enable_auto_choice_passes_with_tool_call_pars": 1132, "actor._actor_id.hex": 1133, "logprobs.slic": 1134, "install_arg": 1135, "decompil": 1136, "public": 1137, "pallasattentionbackend.get_page_s": 1138, "new_k_tile_1": 1139, "gumbel_softmax": 1140, "local-model": 1141, "--limit-k": 1142, "_find_dtyp": 1143, "llama-3.3-70b-instruct": 1144, "oad": 1145, ".block_id": 1146, "middl": 1147, "loadformat": 1148, "example_mo": 1149, "node.decorator_list": 1150, "vlm.to": 1151, "nvml_error_gpu_is_lost": 1152, "found_suffix": 1153, "wrapped_modul": 1154, "hidden_states.transpos": 1155, "expected_cont": 1156, "url_1": 1157, "attn.quant_method": 1158, "target.weighteddur": 1159, "dgm": 1160, "self.output_id": 1161, "decodingconfig": 1162, "inter_data": 1163, "--enable-ssl-refresh": 1164, "enable_auto_tool_choic": 1165, "rhyme": 1166, "7168.": 1167, "step3": 1168, "patch_attn_mask.unsqueez": 1169, "p2p": 1170, "tensors.w2": 1171, "pe_weight": 1172, "_rope_dict": 1173, "tpu_info.device.get_local_chip": 1174, "futures.thread": 1175, "shared_by.append": 1176, "usagecontext.engin": 1177, "pattern_repeat": 1178, "rank-stabil": 1179, "scheduler_output.structured_output_request_ids.item": 1180, "rag.": 1181, "audio_config.hidden_s": 1182, "llm.llm_engine.get_tokenizer_group": 1183, "penalize.extend": 1184, "nvml_gpu_fabric_health_mask_access_timeout_recovery_tru": 1185, "traceback": 1186, "io.byt": 1187, "_lora_shrink_kernel": 1188, "rain.": 1189, "cross_encoder.html": 1190, "lora-test-2": 1191, ".dt_proj": 1192, "torch.sigmoid": 1193, "run_e5_v": 1194, "-0.0888671875": 1195, "indices.flatten": 1196, "acc_scal": 1197, ".co": 1198, "nvmldeviceismigdevicehandl": 1199, ".text.strip": 1200, "addresses.coordin": 1201, "scheduler_stats.prefix_cache_stats.queri": 1202, "8.8.8.8": 1203, "chunk_indices_p": 1204, "layer_norm_func": 1205, "xfers.": 1206, "args.vllm": 1207, "nvmlecccountertyp": 1208, "3.1": 1209, "seq.tokens.extend": 1210, "w1": 1211, "v.task_spec.sub_label": 1212, "fusedrmsquantkey": 1213, "model_group": 1214, "torch.xpu.curr": 1215, "args.output": 1216, "sampling_params.extra_args.get": 1217, "status.nev": 1218, ".logprob": 1219, "id.g31441846c39": 1220, "swang": 1221, "enable_debugging.pi": 1222, "refinedweb": 1223, "new_reqs.append": 1224, "llm.collective_rpc": 1225, "self.skip_special_token": 1226, "tpu_commons.platforms.tpu_jax.tpuplatform": 1227, ".ffn.inner_proj.": 1228, "ggmlquantizationtype.iq1_m": 1229, "test_infeasible_swap": 1230, "_get_unique_nam": 1231, "vllminductorpass.hash_sourc": 1232, "whispermultimodalprocessor": 1233, "spec_output.output": 1234, "paged_kv_indices_buff": 1235, "token_ids_to_pen": 1236, "failed_request_id": 1237, "per-batch": 1238, "unsupported_quant_config": 1239, "relat": 1240, "engine.output": 1241, "unex": 1242, "aq.shap": 1243, "rename_mapping.item": 1244, "image_feature.devic": 1245, "_assert_valid": 1246, "--from": 1247, "nvmldevicesetclockoffset": 1248, "final_prompt_len": 1249, "cast_from_fp4": 1250, "utils.processors.ovi": 1251, "d2h": 1252, "visionattent": 1253, "------------": 1254, "resolve_min_max_num": 1255, "image_features_flat": 1256, "emb_sin": 1257, "with_dyn_arg": 1258, "max_im_w": 1259, "connector.engin": 1260, "self.embedding_modul": 1261, "line.low": 1262, "chunk_topk_id": 1263, "use_cuda_graph": 1264, "w-msa": 1265, "_async_socket_engine_callback": 1266, "config.audio_config.d_model": 1267, "kv_ptr": 1268, "first_expert": 1269, "seq.seq": 1270, "self._convert_stats_tree_to_dict": 1271, "vocab_size_pad": 1272, "mock_cuda_graph": 1273, "_match_fused_lay": 1274, "following.": 1275, "live_think.markdown": 1276, "results.": 1277, "self.speculative_token_tre": 1278, "self.path.rglob": 1279, "enabled.cach": 1280, "onevision-multiple-imag": 1281, "counter_generation_token": 1282, "sch.epilogue_schedul": 1283, "complete.": 1284, "tpuplatform": 1285, "kv_cache_quant_method": 1286, ".embed_util": 1287, "method_has_implemented_embed": 1288, "self._parse_and_validate_audio_input": 1289, "hfaudioitem": 1290, "ignore_warn": 1291, "c_coolerinfo.vers": 1292, "moe_layers_idx": 1293, "uniform_decod": 1294, "anything-llm-chat-with-doc.png": 1295, "jcristharif.com": 1296, "safetensors_pattern": 1297, "test_compressed_tensors_w8a8_dynamic_per_token": 1298, "test_get_typ": 1299, "self.quant_config.is_per_tensor": 1300, "current_t": 1301, "non-standard": 1302, "480.0": 1303, "self.first_req_rcv_socket": 1304, "runtimeenv": 1305, "self.max_prefill_seq_len": 1306, "features_with_newlines_flat": 1307, "_partit": 1308, "self.num_prompt": 1309, "otel_exporter_otlp_traces_protocol": 1310, "bool.": 1311, "v_block": 1312, ".test_ultravox": 1313, "test_slice_to_end": 1314, "onfig.first_k_dense_replac": 1315, "choice-bas": 1316, "sampling_metadata.top_p": 1317, "rel_path": 1318, "self._compiled_ray_dag": 1319, "x_k": 1320, "self._get_num_frame_token": 1321, "subprocess.pip": 1322, "triton_languag": 1323, "test_ptpc_fp8_rocm": 1324, "weight.shap": 1325, ".parent.i": 1326, "last_useful_block": 1327, "cur_n": 1328, "raw_img": 1329, "self._model_info.supports_cross_encod": 1330, "self._extra_async_saves.get": 1331, "_try_parse_json_tool": 1332, "envs.cmake_build_typ": 1333, "b.is_contigu": 1334, "args.tensor_parallel_s": 1335, "myrank": 1336, "self.scale_factor": 1337, "grid.shap": 1338, "libpng-devel": 1339, "file": 1340, "dpenginecoreactor": 1341, "lambda": 1342, "pynccl_comm.reduce_scatterv": 1343, "self.store.set": 1344, "__expf": 1345, "adapter_config.json.": 1346, "packed.devic": 1347, "kvpipebas": 1348, "gen_ai.latency.e2": 1349, "nvml_ecc_error_type_count": 1350, "input-length-rang": 1351, "b.default": 1352, "attentionimpl.": 1353, "shrink_fun": 1354, "tokenizechatrequest": 1355, "storage2-work": 1356, "add": 1357, "expert_x_fp8.is_contigu": 1358, "top_lp": 1359, "moe_align_block_s": 1360, "time_after_wakeup": 1361, "app.state.decode_iter": 1362, "40s": 1363, "self.vision_mo": 1364, "shall": 1365, "self.use_pynccl": 1366, "nginx.md": 1367, "vllm.v1.engine.parallel": 1368, "nvmldevicegetcurrentclockseventreason": 1369, "parser.exit_on_error": 1370, "chunk_mask": 1371, "validate_num_item": 1372, "vllm.task": 1373, "nemotron-na": 1374, "hetensor": 1375, "reinforc": 1376, "req_idx_tensor": 1377, "serializedrequest": 1378, "media.numpi": 1379, "opencv": 1380, "snapshot.": 1381, "is_channel_group": 1382, "put_linear.weight": 1383, "w2.reshap": 1384, "stats.gpu": 1385, "sharded_output.shap": 1386, "arch_overview.md": 1387, "num_heads_kv": 1388, ".log10": 1389, "build_single_image_input": 1390, "utils.configs.arct": 1391, "uniform_probs_ptr": 1392, "read_flag": 1393, "req_state.stat": 1394, "_maybe_allocate_hashless_block_id": 1395, "out.dtyp": 1396, "v_hbm_tile.shap": 1397, "processor_outputs.item": 1398, "docs.cohere.com": 1399, "gpus.": 1400, "model_template_generation_output": 1401, "init_messag": 1402, "image.lanczo": 1403, "self.init_par": 1404, "poller.pol": 1405, "new_data_parallel_master_port": 1406, "test_engine_process_death": 1407, "serving_results.append": 1408, "abc-123": 1409, "_verify_and_get_draft_tp": 1410, "gone.": 1411, "orig_repl": 1412, "self.batch": 1413, "vllm.entrypoints.openai.serving_engine.open": 1414, "audio_input_features.to": 1415, "self.heartbeat_socket.bind": 1416, "expected_gguf_key": 1417, "religion": 1418, "zhenfund": 1419, "mamba_padding_pct": 1420, "match.start": 1421, "timodal_config.get_limit_per_prompt": 1422, "working-with-repository-security-advisori": 1423, "make_names_uniqu": 1424, "envs.vllm_test_force_fp8_marlin": 1425, "resolve_visual_encoder_output": 1426, "prev_msg_i": 1427, "max_num_scheduled_tokens_all_req": 1428, "self.sync_weight_attr": 1429, "shapes.": 1430, "enginehandshakemetadata": 1431, "req.kv": 1432, "purpl": 1433, "nvshmem_alloc_empty_unique_id": 1434, "case_filtering.pi": 1435, "seq_group_2": 1436, "vllm.v1.sample.logit": 1437, "deltas.": 1438, "address.": 1439, "lnh-": 1440, "mplinearlayerconfig": 1441, "1h24phewanyrl11xy5dxubvrc9f9kkjix": 1442, "import.": 1443, "apply_delta": 1444, "_regist": 1445, "tensorwise_group_shap": 1446, "ray.is_initi": 1447, "quantconfig": 1448, "ninstruct": 1449, "meta-llama-3.1-8b": 1450, "self.async": 1451, "triton.runtime.autotuner.outofresourc": 1452, "cvt": 1453, "rot_pos_emb": 1454, "step3-vl": 1455, "llm-fork": 1456, "attn_metadata.paged_kv_indptr_gpu": 1457, ".cb": 1458, "create_encoder_prompt": 1459, "types.uint3b4": 1460, "nvml_gpu_nvlink_bw_mode_off": 1461, "topk.": 1462, "attn.k": 1463, "self.w1_gs.to": 1464, "embed.proj.weight.dtyp": 1465, "state.recv_st": 1466, "module.children": 1467, "time_start": 1468, "self.feature_sample_lay": 1469, "computed_block": 1470, "tokenizer.__call__": 1471, "base_indic": 1472, "dequant_typ": 1473, "alik": 1474, "resolve_model_cl": 1475, "s3fs.s3file": 1476, "dynamic_output": 1477, "sharegpt": 1478, "vllm.model_executor.layers.quantization.neuron_qu": 1479, "try_get_tokenizer_config": 1480, "blocks.get_block_id": 1481, "self.q_weight": 1482, "moe_permute_unpermute.pi": 1483, "propose_draft_token_id": 1484, "base_patch_embeds.devic": 1485, "qq_bias_ptr": 1486, "qkv_proj.quant_method": 1487, "validate_regex_is_build": 1488, "perform.": 1489, "tester": 1490, "core_to_cpus": 1491, "init_weight_update_group": 1492, "self.grammar_bitmask_cpu.zero_": 1493, "max_task": 1494, "3rd": 1495, "torch.ops.vllm.rocm_aiter_gemm_w8a8_blockscal": 1496, "func.__name__": 1497, "lion": 1498, "lineno": 1499, "num_reqs_assign": 1500, "param_nam": 1501, "apple.": 1502, ".model": 1503, "large_tile_sz": 1504, "slowdown": 1505, "request.lora_request.nam": 1506, "sv": 1507, "path-lik": 1508, "gemm_r": 1509, "llm.appli": 1510, "self._check_scheme_support": 1511, "hub.errors.offlinemodeisen": 1512, "bt.w_q.t": 1513, "tl.float16": 1514, "self.mm_cache.clear": 1515, "another_funct": 1516, "prithvigeospatialmaeinputbuild": 1517, "args.ramp_up_start_rp": 1518, "bonus_logits_indic": 1519, "meta_reordered.dim": 1520, "gc_disabl": 1521, "inter_data.lora_prompt_map": 1522, "post-train": 1523, "cpm-s-1b-sft": 1524, "-0.0": 1525, "dp_master_ip": 1526, "factories.contain": 1527, "config.lm_head_multipli": 1528, "get_device_nam": 1529, "mistral_model_id": 1530, "std.": 1531, "llavalikeconfig": 1532, "cached_properti": 1533, "audio_feature_lens.": 1534, "req_output.outputs.scor": 1535, "config.attn_config.alibi": 1536, "--hf-subset": 1537, "exceptions.pi": 1538, "noaux_tc": 1539, "w_q": 1540, "expected_kwarg": 1541, "decode_num_token": 1542, "req_state.num_cached_token": 1543, "data.tpot_m": 1544, "allgathercutlassscaledmmpattern": 1545, "torch.mul": 1546, "maybe_chunk_by_rank": 1547, "test_guided_choice_chat": 1548, "layer.qweight.shard": 1549, "self.generic_visit": 1550, "5.2f": 1551, "synchron": 1552, "name.startswith": 1553, "regex.findit": 1554, "frames_idx_token": 1555, "self.hf_text_config.model.model_typ": 1556, "layer.hidden": 1557, "layer.attn.attn.kv": 1558, "pred_imgs.append": 1559, "epiloguescheduletyp": 1560, "bte_war": 1561, "grp.ab": 1562, "decode_meta.max_decode_seq_len": 1563, "track_emb": 1564, "something_els": 1565, "factory_meth": 1566, "q_inter_crit": 1567, "block_sparse_moe.experts.": 1568, "self.kwargs_list": 1569, "self.target_token2": 1570, "input_data.to": 1571, "num_valid_token": 1572, "np.zero": 1573, "test_ranks.pi": 1574, "fusedquantkey": 1575, "concurrent.futures._bas": 1576, "prompt_logprob": 1577, "nvml_fi_dev_nvlink_count_rcv_general_error": 1578, "module.dummylogitsprocessor": 1579, "in.weight.dtyp": 1580, "float8_e5m2": 1581, "_long_info.max": 1582, "vseq_group": 1583, "self.b1": 1584, "packages-that-exist-on-multiple-index": 1585, "request_ids_to_abort.append": 1586, "p_tgt": 1587, "be...": 1588, "type.s32": 1589, "_get_depth_count": 1590, "solar.pi": 1591, "safetensor": 1592, "use": 1593, "insecur": 1594, "p_partial_sum": 1595, "qk_psum": 1596, "ubatch": 1597, "weights.union": 1598, "envs.vllm_log_stats_interv": 1599, "get_max_audio_token": 1600, "nvmlcomputeinstanceprofileinfo_v2": 1601, "speculation_config.draft_model_config.override_neuron_config": 1602, "_find_mm_placehold": 1603, "combo": 1604, "...models.language.pooling.emb": 1605, "self.prediction_coef": 1606, "self.input_tensor": 1607, "pend": 1608, "executor_fail_callback": 1609, "v.repeat": 1610, "compilationcount": 1611, ".venv": 1612, "wrapped_sf": 1613, "tool_parser.model_tokenizer.token": 1614, "module.i": 1615, "get_replacement_qwen2_audio": 1616, "bbx": 1617, "openai_responses_types.responseoutputtext": 1618, "test_get_vllm_port_uri": 1619, "target_pa": 1620, "tuple_nod": 1621, "openaiharmonymessag": 1622, "is_pooling_model": 1623, "nvml_fi_dev_nvlink_ecc_data_error_count_l0": 1624, "seq_group_meta.encoder_seq_data": 1625, "current_definition.append": 1626, "positions.offset": 1627, "delta_message.tool_cal": 1628, "_update_stats_from_output": 1629, "std.tolist": 1630, "thinker.pi": 1631, "backend.low": 1632, "roi": 1633, "w_ref2_l.append": 1634, "self.kv_cache_dtyp": 1635, "_write_to_fil": 1636, "self.schedul": 1637, "self._process_encoder_decoder_prompt_async": 1638, "with_think": 1639, "usa": 1640, "555-6789": 1641, "incremental_prefill_support": 1642, "customop.": 1643, "self.mup_width_scal": 1644, "args.block_shap": 1645, "placementgroup": 1646, "incomplet": 1647, "gemms.pi": 1648, "backend-block_s": 1649, "embeddings_tensor.shap": 1650, "olmo.pi": 1651, "c_fb_size": 1652, "scale.t.contigu": 1653, "communiti": 1654, "num_watermark_block": 1655, "sched_output.num_scheduled_token": 1656, "patches.append": 1657, "run_deepseek_vl2": 1658, "lora_kernel_meta.prepare_tensor": 1659, "get_static_graph_wrapper_cl": 1660, "self.conv1d": 1661, "args.token_scale_typ": 1662, "fetchcontent_base_dir": 1663, "eagle-l": 1664, "v1": 1665, "utils.asyncenginearg": 1666, "-prefil": 1667, "obj2.empty_tensor": 1668, "agent_name1..": 1669, "aiohttp_timeout": 1670, "cohere2visionforconditionalgener": 1671, "self._init_pooler_config": 1672, ".dynam": 1673, "extra_layer_output_idx": 1674, "vlmtesttype.audio": 1675, "remaining_cont": 1676, "modifiedwhisperencod": 1677, "self._prev_block.num_tokens_tot": 1678, "out_chunks.append": 1679, ".dt_norm.weight": 1680, "say": 1681, "self._get_indic": 1682, "sig.parameters.item": 1683, "self.ca_comm": 1684, "i_level": 1685, "socket.so_reuseaddr": 1686, "indices.copi": 1687, "self.mla_dim": 1688, "model_utils.minimax_vl_01_patch_hf_runn": 1689, "is_vision_encoder_weight": 1690, "im": 1691, "vm": 1692, "result.torch_peak_increas": 1693, "request.lora_nam": 1694, "timings.": 1695, "self.reorder_prompt_req_index_list": 1696, "num_prefills_with_": 1697, "self.repl": 1698, "._validate_request": 1699, "test_schedule_concurrent_partial_request": 1700, "weight_files_sub_list": 1701, "request.reasoning_effort": 1702, "eighth": 1703, "yongji": 1704, "moe_marlin_generation.log": 1705, "token_type_ids.append": 1706, "self._maybe_force_supported_attention_backend": 1707, "silenc": 1708, "self.compilation_config.cache_dir": 1709, "test_iteration_stat": 1710, "model.layers.1": 1711, "20gmt": 1712, "outputs.": 1713, "num_st": 1714, "get_inductor_factor": 1715, "torch.nn.functional.norm": 1716, "qwen2_5_vl-transform": 1717, "request.lora_path": 1718, "config_by_key": 1719, "ocat": 1720, "dist.al": 1721, "test_basic_vis": 1722, "rasterio.open": 1723, "self.use_all2al": 1724, "recipi": 1725, "src_rang": 1726, "generate_kernels.pi": 1727, "recv_rank": 1728, "text_or_convers": 1729, "vlm": 1730, "block_table.get_unseen_token_id": 1731, "error_callback": 1732, "openai_api_serv": 1733, "f.logical_to_physical_map.shap": 1734, "conch": 1735, "-bit": 1736, "mono": 1737, "model.gguf": 1738, "result.tool": 1739, "first-com": 1740, "elems_in_mod": 1741, "tgt_mask": 1742, "minimax-text": 1743, "lora_adapter_1": 1744, "qkv_in.queri": 1745, "qwen2.5-32b-instruct": 1746, "passthrough": 1747, "ver": 1748, "pre-comput": 1749, "self._topic_byt": 1750, "iter_lora_request": 1751, "parse_fine_tuned_lora_nam": 1752, "shutdown.pi": 1753, "_statstreenod": 1754, "fp_quantiz": 1755, "dispatch_funct": 1756, "monkeypatch.delenv": 1757, "args.dim_incr": 1758, "inter_data.query_len": 1759, "params.temperatur": 1760, "llama-160m-acceler": 1761, "test_dp1": 1762, "_fp8_perm": 1763, "remaining_token_budget": 1764, "transformers_util": 1765, "image-on": 1766, "new_img_width": 1767, "comparis": 1768, "nonzero.": 1769, "q_nope": 1770, "_state._available_resources_per_nod": 1771, "fused_expert_output.dtyp": 1772, "param.data.numel": 1773, "rocm_unquantized_gemm_impl_fak": 1774, "vllm.multimodal.processing.promptupdatedetails.is_emb": 1775, "cpumodelrunn": 1776, "check_unexpected_modul": 1777, "_parse_video_data": 1778, "remote_rank": 1779, "encoder-on": 1780, "hit_blocks_other_attn": 1781, "thistl": 1782, "h_dim": 1783, "norm_output.reshap": 1784, "model.__init__": 1785, "request.module.__name__": 1786, "processor.bo": 1787, "pcie": 1788, "openaiserv": 1789, "multi-resolut": 1790, "prospect": 1791, "_is_wna16_group_channel": 1792, "new_pos_emb": 1793, "layer_attn_metadata.logits_indices_pad": 1794, "poolings.usage.prompt_token": 1795, "cache_indices_ptr": 1796, "repeated_prompts.extend": 1797, "attention_spec": 1798, "self._build_actor_rank_map": 1799, "peek_remov": 1800, "pytest.monkeypatch": 1801, "self.has_allowed_token_ids.add": 1802, "got_ocr2": 1803, "conversationmessag": 1804, "no_penalti": 1805, "mistral_token": 1806, "llm2": 1807, "self.histogram_time_to_first_token": 1808, "popleft": 1809, "kv_cache_spec.key": 1810, "prompt_embeds.squeez": 1811, "state.en": 1812, "exhaust": 1813, "free_gpu_memori": 1814, "probs.masked_fill_": 1815, "longchat-13b-16k": 1816, "haystack.components.generators.chat": 1817, "as_til": 1818, "self._try_load_model_cl": 1819, "stacked.": 1820, "copy.": 1821, "lm-7b-vllm": 1822, "large_k_tile_idx": 1823, "short_chunk": 1824, "top_level_mapping_with_default": 1825, "model_output.startswith": 1826, "optimally.": 1827, "sig.bind": 1828, "device.removeprefix": 1829, "run_dp_sharded_vision_model_vs_direct": 1830, "nixl_agent_meta": 1831, "exploded_indic": 1832, ".e.g.": 1833, "ped": 1834, "self.short": 1835, "_load_prompt_emb": 1836, "mock_run_api_server_work": 1837, "ops.sm100_cutlass_mla_get_workspace_s": 1838, "self.padding_s": 1839, "test_custom_dispatcher.pi": 1840, "bias_k": 1841, "1089.7": 1842, "a_scale1": 1843, "vllm.multimodal.input": 1844, "vllm_use_triton_awq.": 1845, "self.config.mo": 1846, "prepack_typ": 1847, "transformers_modules.": 1848, "35s": 1849, "blk.is": 1850, "4bit.pi": 1851, "self._workspac": 1852, "inter-connect": 1853, "rwjv": 1854, "image_embed": 1855, "deepep_combin": 1856, "config.has_unfinished_dp": 1857, "feature_lens_after_pool": 1858, "grass": 1859, "total_fram": 1860, "functions.get_weath": 1861, "non-topk": 1862, "thinking.find": 1863, "vllm.model_executor.layers.sampler._sampl": 1864, "reason.length": 1865, "max_nb_patches_w": 1866, "path_to_tensor": 1867, "storage_context": 1868, "named_field.default": 1869, "c_info.lowpwrthreshold": 1870, "format_history_to_openai": 1871, "config.splitting_op": 1872, "_process_modul": 1873, "vllm.v1.core.sched.request": 1874, "data_spec.split": 1875, "benchmark_serving_structured_output.pi": 1876, "madhu": 1877, "metrics.aggregated_query_hit": 1878, "default_max_num_seq": 1879, "prior_mask_pad": 1880, "clamped_posit": 1881, "test_w8a8_block_int8_matmul": 1882, "test_allspark_gemm.pi": 1883, "c_result": 1884, "consumer_queue.get": 1885, "self.pattern.format": 1886, "nvml_pcie_atomics_cap_fetchadd32": 1887, "decode_meta.attn_bia": 1888, "torch.complex32": 1889, "processdetaillist.vers": 1890, ".self_attn.": 1891, "bgr2gray": 1892, "--constraint": 1893, "engine_counts.item": 1894, "baichuan_zero_lora_fil": 1895, "types.append": 1896, "metric_nam": 1897, "13b": 1898, "page_table.shap": 1899, "config_dtyp": 1900, "core.scal": 1901, "self._build_logits_processor": 1902, "exclude_tools_when_tool_choice_non": 1903, "adjust_bi": 1904, "qkv_proj.scheme.quant": 1905, "mbps": 1906, "self.last_access": 1907, "c_expert_num_tokens.to": 1908, "pytest_asyncio.fixtur": 1909, "frame.f_lineno": 1910, "create_deterministic_logit": 1911, "dtaset": 1912, "nn.max": 1913, "is_nccl_gath": 1914, "hh": 1915, "create_dummy_emb": 1916, "contextualized_st": 1917, "config.tokenizer_mod": 1918, "test_llama_tp.pi": 1919, "cls.supported_quant": 1920, "res.median": 1921, "build_ext": 1922, "num_gen_seq": 1923, "data_root": 1924, "query_mask_1": 1925, "llama-index-embeddings-openai-lik": 1926, "triton_mla_vllm_v1": 1927, "cur_image.copi": 1928, "vllm.entrypoints.openai.serving_pool": 1929, "self.n_": 1930, "req_indices_to_remove.add": 1931, "layer.forward_n": 1932, "non-distribut": 1933, "everi": 1934, "sudo": 1935, "self.base_layer.tp_s": 1936, "self.apply_bad_word": 1937, "block_out": 1938, "request.structured_output_request.grammar.accept_token": 1939, "mixer_single_gpu.weight.data": 1940, "n_reader": 1941, "remapped_nam": 1942, "worker.init_devic": 1943, "vision_backbone.": 1944, "save.item": 1945, "mind.": 1946, "self.conv1.weight.dtyp": 1947, "publish_front.recv": 1948, "bnb_shard_offset": 1949, "run_square_bench": 1950, "_visible_devic": 1951, "fy.pi": 1952, "test_runai_model_load": 1953, "_walk_json_for_additional_properti": 1954, "tasks.pi": 1955, "trl.onlin": 1956, "design": 1957, "encoder.conv2.strid": 1958, "video_format": 1959, "timeruntot": 1960, "result_offsets_i": 1961, "is.": 1962, "c_nvmlprocessutilizationsample_t": 1963, "vllm.inputs.data.singleton": 1964, "self.stor": 1965, "q_succ_crit": 1966, "input.long": 1967, "icc": 1968, 